{"class_name": "Tokenizer", "config": {"num_words": 10000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 445, "word_counts": "{\"python\": 237, \"is\": 124, \"a\": 203, \"high\": 5, \"level\": 3, \"general\": 4, \"purpose\": 1, \"programming\": 32, \"language\": 44, \"its\": 26, \"design\": 9, \"philosophy\": 7, \"emphasizes\": 1, \"code\": 44, \"readability\": 3, \"with\": 66, \"the\": 288, \"use\": 26, \"of\": 155, \"significant\": 3, \"indentation\": 10, \"dynamically\": 3, \"type\": 15, \"checked\": 2, \"and\": 236, \"garbage\": 4, \"collected\": 1, \"it\": 56, \"supports\": 6, \"multiple\": 5, \"paradigms\": 2, \"including\": 21, \"structured\": 2, \"particularly\": 3, \"procedural\": 1, \"object\": 15, \"oriented\": 9, \"functional\": 4, \"often\": 10, \"described\": 1, \"as\": 89, \"batteries\": 1, \"included\": 2, \"due\": 4, \"to\": 184, \"comprehensive\": 1, \"standard\": 18, \"library\": 13, \"guido\": 5, \"van\": 8, \"rossum\": 7, \"began\": 3, \"working\": 2, \"on\": 24, \"in\": 152, \"late\": 3, \"1980s\": 2, \"successor\": 2, \"abc\": 3, \"first\": 7, \"released\": 11, \"1991\": 1, \"0\": 24, \"was\": 24, \"2000\": 2, \"2008\": 3, \"major\": 6, \"revision\": 1, \"not\": 24, \"completely\": 1, \"backward\": 2, \"compatible\": 4, \"earlier\": 1, \"versions\": 11, \"18\": 2, \"2020\": 4, \"last\": 2, \"release\": 11, \"2\": 33, \"consistently\": 2, \"ranks\": 1, \"one\": 10, \"most\": 14, \"popular\": 4, \"languages\": 28, \"has\": 36, \"gained\": 1, \"widespread\": 1, \"machine\": 9, \"learning\": 3, \"community\": 6, \"history\": 2, \"conceived\": 1, \"by\": 41, \"at\": 15, \"centrum\": 1, \"wiskunde\": 1, \"informatica\": 1, \"cwi\": 1, \"netherlands\": 1, \"which\": 29, \"inspired\": 4, \"setl\": 1, \"capable\": 1, \"exception\": 5, \"handling\": 3, \"interfacing\": 1, \"amoeba\": 1, \"operating\": 4, \"system\": 7, \"implementation\": 9, \"december\": 4, \"1989\": 1, \"shouldered\": 1, \"sole\": 1, \"responsibility\": 1, \"for\": 107, \"project\": 4, \"lead\": 2, \"developer\": 2, \"until\": 3, \"12\": 8, \"july\": 4, \"2018\": 2, \"when\": 4, \"he\": 2, \"announced\": 1, \"his\": 4, \"permanent\": 1, \"vacation\": 1, \"from\": 32, \"responsibilities\": 1, \"python's\": 19, \"benevolent\": 2, \"dictator\": 2, \"life\": 4, \"bdfl\": 2, \"title\": 1, \"bestowed\": 1, \"upon\": 1, \"him\": 1, \"reflect\": 1, \"long\": 2, \"term\": 1, \"commitment\": 1, \"project's\": 1, \"chief\": 1, \"decision\": 1, \"maker\": 1, \"since\": 12, \"come\": 3, \"out\": 3, \"retirement\": 1, \"self\": 4, \"titled\": 1, \"emeritus\": 1, \"january\": 2, \"2019\": 1, \"active\": 2, \"core\": 5, \"developers\": 5, \"elected\": 1, \"five\": 2, \"member\": 1, \"steering\": 2, \"council\": 2, \"name\": 7, \"said\": 2, \"british\": 3, \"comedy\": 3, \"series\": 2, \"monty\": 6, \"flying\": 1, \"circus\": 1, \"16\": 1, \"october\": 2, \"many\": 22, \"new\": 14, \"features\": 14, \"such\": 22, \"list\": 8, \"comprehensions\": 4, \"cycle\": 2, \"detecting\": 2, \"collection\": 2, \"reference\": 12, \"counting\": 2, \"unicode\": 1, \"support\": 22, \"7's\": 1, \"end\": 4, \"initially\": 2, \"set\": 3, \"2015\": 1, \"then\": 7, \"postponed\": 1, \"concern\": 1, \"that\": 47, \"large\": 6, \"body\": 2, \"existing\": 2, \"could\": 1, \"easily\": 3, \"be\": 57, \"forward\": 1, \"ported\": 2, \"3\": 68, \"no\": 8, \"further\": 4, \"security\": 10, \"patches\": 2, \"or\": 42, \"other\": 20, \"improvements\": 1, \"will\": 14, \"while\": 8, \"7\": 15, \"older\": 3, \"are\": 56, \"officially\": 1, \"unsupported\": 3, \"different\": 4, \"unofficial\": 2, \"pypy\": 7, \"continues\": 2, \"i\": 8, \"plus\": 3, \"10\": 7, \"meaning\": 3, \"least\": 5, \"some\": 20, \"backported\": 1, \"updates\": 2, \"semantics\": 10, \"changed\": 7, \"syntax\": 22, \"every\": 2, \"now\": 3, \"5\": 12, \"added\": 6, \"few\": 4, \"later\": 3, \"releases\": 9, \"have\": 12, \"dropped\": 4, \"outdated\": 3, \"modules\": 13, \"minor\": 1, \"way\": 6, \"2024\": 4, \"13\": 7, \"latest\": 6, \"stable\": 2, \"more\": 13, \"months\": 2, \"only\": 8, \"bug\": 4, \"fixes\": 2, \"opposed\": 1, \"just\": 7, \"9\": 4, \"oldest\": 1, \"supported\": 9, \"version\": 13, \"albeit\": 1, \"'security\": 1, \"support'\": 1, \"phase\": 1, \"8\": 9, \"reaching\": 1, \"starting\": 3, \"years\": 4, \"full\": 3, \"up\": 6, \"half\": 2, \"followed\": 1, \"same\": 9, \"total\": 1, \"before\": 8, \"were\": 7, \"expedited\": 1, \"2021\": 2, \"again\": 2, \"twice\": 1, \"2022\": 4, \"fixed\": 3, \"2023\": 1, \"september\": 1, \"6\": 4, \"down\": 1, \"20\": 2, \"all\": 12, \"insecure\": 1, \"because\": 4, \"issues\": 5, \"leading\": 1, \"possible\": 7, \"remote\": 1, \"execution\": 5, \"web\": 7, \"cache\": 1, \"poisoning\": 1, \"union\": 1, \"operator\": 16, \"match\": 2, \"case\": 3, \"keywords\": 3, \"structural\": 1, \"pattern\": 2, \"matching\": 2, \"statements\": 12, \"11\": 7, \"expanded\": 1, \"functionality\": 7, \"keyword\": 3, \"notable\": 2, \"changes\": 3, \"include\": 10, \"increased\": 1, \"program\": 8, \"speed\": 11, \"improved\": 7, \"error\": 3, \"reporting\": 1, \"claims\": 4, \"between\": 6, \"60\": 2, \"faster\": 4, \"than\": 17, \"adds\": 3, \"another\": 2, \"top\": 2, \"also\": 28, \"messages\": 1, \"14\": 3, \"introduces\": 2, \"types\": 5, \"interactive\": 1, \"interpreter\": 10, \"repl\": 2, \"featuring\": 1, \"multi\": 3, \"line\": 3, \"editing\": 1, \"color\": 1, \"an\": 27, \"incremental\": 1, \"collector\": 2, \"producing\": 2, \"shorter\": 1, \"pauses\": 1, \"programs\": 12, \"lot\": 1, \"objects\": 4, \"addition\": 5, \"experimental\": 5, \"time\": 11, \"jit\": 3, \"compiler\": 9, \"can\": 23, \"needs\": 3, \"enabled\": 3, \"specifically\": 1, \"increase\": 2, \"free\": 2, \"threaded\": 1, \"build\": 2, \"mode\": 3, \"disables\": 1, \"global\": 2, \"lock\": 4, \"gil\": 1, \"allowing\": 5, \"threads\": 1, \"run\": 6, \"concurrently\": 1, \"latter\": 2, \"feature\": 4, \"python3\": 2, \"13t\": 1, \"change\": 3, \"behavior\": 4, \"well\": 5, \"defined\": 4, \"fixing\": 1, \"bugs\": 3, \"removals\": 1, \"deprecated\": 6, \"classes\": 9, \"functions\": 11, \"methods\": 8, \"removed\": 5, \"c\": 35, \"api\": 6, \"old\": 2, \"locals\": 3, \"frame\": 1, \"f\": 2, \"slow\": 1, \"inconsistent\": 1, \"buggy\": 1, \"corner\": 1, \"cases\": 4, \"oddities\": 1, \"works\": 2, \"around\": 1, \"those\": 1, \"may\": 14, \"need\": 3, \"uses\": 23, \"simple\": 5, \"templating\": 1, \"print\": 2, \"debugging\": 2, \"continue\": 3, \"work\": 4, \"correctly\": 1, \"sigstore\": 2, \"digital\": 1, \"verification\": 1, \"signatures\": 1, \"cpython\": 13, \"artifacts\": 1, \"pgp\": 3, \"been\": 9, \"criticized\": 1, \"practitioners\": 1, \"moving\": 2, \"exclusively\": 1, \"dropping\": 1, \"alpha\": 3, \"regarding\": 1, \"annotations\": 6, \"future\": 3, \"import\": 4, \"did\": 1, \"converting\": 1, \"into\": 8, \"strings\": 7, \"pep\": 6, \"711\": 1, \"proposes\": 1, \"pybi\": 1, \"format\": 8, \"distributing\": 1, \"binaries\": 1, \"15\": 1, \"make\": 2, \"utf\": 3, \"default\": 2, \"exists\": 1, \"current\": 8, \"but\": 18, \"currently\": 1, \"opted\": 1, \"already\": 3, \"used\": 39, \"windows\": 7, \"elsewhere\": 1, \"things\": 1, \"e\": 18, \"open\": 2, \"files\": 1, \"it's\": 3, \"enabling\": 2, \"makes\": 2, \"fully\": 2, \"cross\": 5, \"platform\": 3, \"everything\": 1, \"platforms\": 4, \"paradigm\": 1, \"their\": 8, \"aspect\": 1, \"metaprogramming\": 2, \"metaobjects\": 1, \"via\": 5, \"extensions\": 4, \"contract\": 1, \"logic\": 2, \"referred\": 3, \"'glue\": 1, \"language'\": 1, \"seamlessly\": 1, \"integrate\": 1, \"components\": 1, \"written\": 13, \"dynamic\": 6, \"typing\": 7, \"combination\": 3, \"memory\": 1, \"management\": 2, \"resolution\": 1, \"binding\": 2, \"binds\": 2, \"method\": 7, \"variable\": 9, \"names\": 4, \"during\": 3, \"offers\": 1, \"lisp\": 2, \"tradition\": 1, \"filter\": 1, \"mapandreduce\": 1, \"dictionaries\": 4, \"sets\": 1, \"generator\": 5, \"expressions\": 16, \"two\": 6, \"itertools\": 1, \"functools\": 1, \"implement\": 2, \"tools\": 5, \"borrowed\": 2, \"haskell\": 1, \"ml\": 1, \"summarized\": 1, \"zen\": 2, \"includes\": 4, \"aphorisms\": 1, \"beautiful\": 1, \"better\": 5, \"ugly\": 1, \"explicit\": 2, \"implicit\": 2, \"complex\": 4, \"complicated\": 1, \"counts\": 1, \"however\": 7, \"regularly\": 1, \"violate\": 1, \"these\": 9, \"principles\": 1, \"received\": 1, \"criticism\": 1, \"adding\": 8, \"unnecessary\": 1, \"bloat\": 1, \"responses\": 1, \"criticisms\": 1, \"guideline\": 1, \"rather\": 6, \"rule\": 2, \"had\": 2, \"so\": 3, \"controversial\": 1, \"resigned\": 1, \"following\": 1, \"vitriol\": 1, \"over\": 6, \"assignment\": 5, \"expression\": 12, \"nevertheless\": 1, \"building\": 1, \"designed\": 3, \"highly\": 1, \"extensible\": 2, \"this\": 12, \"compact\": 1, \"modularity\": 1, \"made\": 2, \"means\": 4, \"programmable\": 2, \"interfaces\": 2, \"applications\": 9, \"rossum's\": 1, \"vision\": 2, \"small\": 1, \"stemmed\": 1, \"frustrations\": 1, \"espoused\": 1, \"opposite\": 1, \"approach\": 2, \"strive\": 2, \"simpler\": 1, \"less\": 3, \"cluttered\": 1, \"grammar\": 1, \"giving\": 1, \"choice\": 2, \"coding\": 2, \"methodology\": 1, \"contrast\": 4, \"perl's\": 1, \"there\": 10, \"do\": 3, \"motto\": 1, \"embraces\": 1, \"should\": 4, \"one\\u2014and\": 1, \"preferably\": 1, \"one\\u2014obvious\": 1, \"practice\": 2, \"provides\": 6, \"ways\": 2, \"achieve\": 1, \"task\": 1, \"example\": 13, \"three\": 4, \"string\": 10, \"literal\": 3, \"certainty\": 1, \"programmer\": 1, \"alex\": 1, \"martelli\": 1, \"fellow\": 1, \"software\": 5, \"foundation\": 2, \"book\": 1, \"author\": 1, \"wrote\": 1, \"describe\": 1, \"something\": 2, \"'clever'\": 1, \"considered\": 1, \"compliment\": 1, \"culture\": 2, \"usually\": 2, \"avoid\": 1, \"premature\": 1, \"optimization\": 3, \"reject\": 1, \"non\": 3, \"critical\": 2, \"parts\": 3, \"would\": 3, \"offer\": 1, \"marginal\": 1, \"increases\": 1, \"cost\": 1, \"clarity\": 1, \"extension\": 2, \"using\": 11, \"like\": 20, \"compile\": 6, \"either\": 2, \"doesn't\": 1, \"provide\": 1, \"might\": 1, \"expected\": 4, \"very\": 3, \"restricted\": 2, \"subset\": 6, \"compiled\": 3, \"possibly\": 1, \"slightly\": 2, \"aim\": 2, \"fun\": 1, \"reflected\": 1, \"name\\u2014a\": 1, \"tribute\": 1, \"group\": 2, \"python\\u2014and\": 1, \"occasionally\": 1, \"playful\": 1, \"approaches\": 1, \"tutorials\": 1, \"materials\": 1, \"terms\": 2, \"spam\": 8, \"eggs\": 9, \"sketch\": 1, \"examples\": 3, \"instead\": 3, \"foo\": 2, \"bar\": 2, \"common\": 6, \"neologism\": 1, \"pythonic\": 2, \"wide\": 2, \"range\": 2, \"meanings\": 1, \"related\": 3, \"style\": 6, \"idioms\": 1, \"natural\": 3, \"show\": 3, \"fluency\": 1, \"conform\": 1, \"minimalist\": 1, \"emphasis\": 1, \"difficult\": 1, \"understand\": 1, \"reads\": 1, \"rough\": 2, \"transcription\": 1, \"called\": 7, \"unpythonic\": 1, \"meant\": 1, \"readable\": 2, \"formatting\": 1, \"visually\": 1, \"uncluttered\": 1, \"english\": 1, \"where\": 8, \"punctuation\": 1, \"unlike\": 4, \"does\": 5, \"curly\": 2, \"brackets\": 2, \"delimit\": 2, \"blocks\": 3, \"semicolons\": 1, \"after\": 4, \"allowed\": 1, \"rarely\": 1, \"fewer\": 1, \"syntactic\": 2, \"exceptions\": 2, \"special\": 2, \"pascal\": 1, \"whitespace\": 1, \"comes\": 2, \"certain\": 3, \"decrease\": 1, \"signifies\": 1, \"block\": 10, \"thus\": 4, \"program's\": 1, \"visual\": 4, \"structure\": 2, \"accurately\": 1, \"represents\": 1, \"semantic\": 3, \"sometimes\": 2, \"termed\": 1, \"off\": 1, \"side\": 4, \"recommended\": 1, \"indent\": 1, \"size\": 1, \"four\": 2, \"spaces\": 1, \"control\": 2, \"flow\": 2, \"statement\": 23, \"single\": 6, \"equals\": 1, \"sign\": 3, \"if\": 10, \"conditionally\": 1, \"executes\": 3, \"along\": 1, \"else\": 3, \"elif\": 1, \"contraction\": 1, \"iterates\": 1, \"iterable\": 2, \"capturing\": 1, \"each\": 8, \"element\": 3, \"local\": 2, \"attached\": 3, \"condition\": 1, \"true\": 3, \"try\": 2, \"allows\": 5, \"raised\": 1, \"caught\": 2, \"handled\": 2, \"except\": 3, \"clauses\": 1, \"groups\": 1, \"ensures\": 1, \"clean\": 1, \"finally\": 2, \"always\": 4, \"regardless\": 1, \"how\": 3, \"exits\": 2, \"raise\": 3, \"specified\": 3, \"re\": 1, \"class\": 10, \"attaches\": 1, \"namespace\": 1, \"def\": 2, \"defines\": 1, \"function\": 12, \"encloses\": 1, \"within\": 1, \"context\": 1, \"manager\": 2, \"acquiring\": 1, \"releasing\": 1, \"opening\": 1, \"closing\": 1, \"file\": 1, \"resource\": 1, \"acquisition\": 1, \"initialization\": 1, \"raii\": 1, \"replacing\": 1, \"idiom\": 1, \"break\": 2, \"loop\": 2, \"skips\": 1, \"rest\": 1, \"iteration\": 1, \"next\": 1, \"del\": 1, \"removes\": 1, \"variable\\u2014deleting\": 1, \"value\": 7, \"redefined\": 1, \"pass\": 2, \"serving\": 1, \"nop\": 1, \"syntactically\": 1, \"needed\": 1, \"create\": 2, \"empty\": 1, \"assert\": 1, \"check\": 1, \"conditions\": 1, \"apply\": 1, \"yield\": 1, \"returns\": 4, \"coroutines\": 2, \"return\": 2, \"whose\": 1, \"variables\": 4, \"analog\": 1, \"switch\": 1, \"construct\": 1, \"compares\": 2, \"against\": 1, \"measure\": 1, \"separate\": 1, \"allocated\": 1, \"subsequently\": 1, \"rebound\": 1, \"any\": 2, \"generic\": 1, \"holder\": 1, \"without\": 1, \"data\": 9, \"refers\": 1, \"typing\\u2014in\": 1, \"statically\": 2, \"typed\": 5, \"contain\": 3, \"tail\": 1, \"call\": 2, \"continuations\": 1, \"according\": 2, \"never\": 1, \"coroutine\": 1, \"provided\": 3, \"extending\": 1, \"generators\": 7, \"lazy\": 1, \"iterators\": 2, \"passed\": 2, \"unidirectionally\": 1, \"back\": 2, \"through\": 3, \"stack\": 2, \"levels\": 1, \"operators\": 5, \"mathematical\": 1, \"subtraction\": 1, \"multiplication\": 2, \"similar\": 8, \"division\": 15, \"differs\": 1, \"divisions\": 1, \"floor\": 4, \"integer\": 5, \"floating\": 4, \"point\": 4, \"exponentiation\": 2, \"concatenation\": 1, \"duplicating\": 2, \"number\": 11, \"times\": 2, \"infix\": 2, \"intended\": 1, \"libraries\": 10, \"numpy\": 4, \"matrix\": 1, \"walrus\": 1, \"introduced\": 2, \"assigns\": 2, \"values\": 4, \"part\": 10, \"larger\": 3, \"compare\": 2, \"identities\": 1, \"comparison\": 4, \"comparisons\": 1, \"chained\\u2014for\": 1, \"b\": 16, \"boolean\": 2, \"named\": 3, \"comprehension\": 1, \"anonymous\": 1, \"implemented\": 4, \"lambda\": 2, \"conditional\": 4, \"x\": 3, \"y\": 2, \"order\": 2, \"operands\": 1, \"distinction\": 2, \"lists\": 4, \"tuples\": 4, \"1\": 13, \"mutable\": 1, \"cannot\": 5, \"keys\": 3, \"dictionary\": 1, \"must\": 1, \"immutable\": 4, \"tuple's\": 1, \"elements\": 4, \"concatenate\": 1, \"directly\": 1, \"modify\": 2, \"contents\": 2, \"produces\": 3, \"tuple\": 3, \"containing\": 1, \"both\": 6, \"given\": 3, \"t\": 5, \"equal\": 3, \"executing\": 1, \"4\": 11, \"evaluates\": 2, \"yields\": 1, \"assigned\": 2, \"t\\u2014thereby\": 1, \"effectively\": 1, \"modifying\": 1, \"conforming\": 1, \"nature\": 2, \"parentheses\": 1, \"optional\": 2, \"unambiguous\": 1, \"contexts\": 1, \"sequence\": 1, \"unpacking\": 1, \"evaluating\": 1, \"anything\": 1, \"writable\": 2, \"property\": 1, \"etc\": 2, \"associated\": 1, \"identical\": 2, \"manner\": 2, \"forming\": 1, \"literals\\u2014and\": 1, \"whole\": 1, \"put\": 1, \"left\": 2, \"hand\": 2, \"expects\": 1, \"right\": 1, \"iterated\": 1, \"them\": 4, \"produced\": 1, \"corresponding\": 1, \"analogously\": 1, \"printf\": 1, \"c\\u2014e\": 1, \"s\": 1, \"d\": 1, \"blah\": 4, \"supplemented\": 1, \"str\": 1, \"f'spam\": 1, \"'\": 1, \"concatenated\": 1, \"integers\": 4, \"floats\": 1, \"spameggs\": 1, \"numbers\": 5, \"they\": 4, \"22\": 1, \"various\": 3, \"literals\": 2, \"delimited\": 1, \"double\": 4, \"quotes\": 3, \"unix\": 2, \"shells\": 3, \"perl\": 4, \"influenced\": 4, \"backslash\": 1, \"escape\": 2, \"character\": 1, \"interpolation\": 1, \"became\": 1, \"available\": 5, \"formatted\": 1, \"triple\": 1, \"quoted\": 1, \"beginning\": 2, \"ending\": 2, \"span\": 1, \"lines\": 1, \"here\": 2, \"documents\": 1, \"ruby\": 3, \"raw\": 2, \"varieties\": 1, \"denoted\": 2, \"prefixing\": 1, \"r\": 1, \"sequences\": 1, \"interpreted\": 1, \"hence\": 1, \"useful\": 2, \"backslashes\": 1, \"regular\": 2, \"paths\": 1, \"quoting\": 1, \"array\": 3, \"index\": 6, \"slicing\": 2, \"key\": 1, \"start\": 3, \"stop\": 3, \"step\": 2, \"indexes\": 3, \"zero\": 2, \"based\": 8, \"negative\": 6, \"relative\": 1, \"slices\": 1, \"take\": 1, \"third\": 5, \"slice\": 3, \"parameter\": 2, \"stride\": 1, \"skipped\": 1, \"reversed\": 1, \"omitted\\u2014for\": 1, \"copy\": 2, \"entire\": 1, \"shallow\": 1, \"rigidly\": 1, \"enforced\": 2, \"scheme\": 1, \"leads\": 1, \"vs\": 3, \"loops\": 1, \"eval\": 1, \"exec\": 2, \"built\": 2, \"former\": 1, \"expression\\u2014so\": 1, \"being\": 3, \"particular\": 2, \"form\": 1, \"object's\": 1, \"instance\": 5, \"argument\": 2, \"normal\": 1, \"sugar\": 3, \"access\": 1, \"java\": 8, \"objective\": 1, \"dunder\": 1, \"underscores\": 1, \"allow\": 2, \"user\": 4, \"native\": 4, \"operations\": 6, \"length\": 1, \"arithmetic\": 5, \"conversion\": 1, \"duck\": 1, \"untyped\": 1, \"constraints\": 1, \"fail\": 1, \"signifying\": 1, \"suitable\": 1, \"despite\": 2, \"strongly\": 1, \"forbidding\": 1, \"silently\": 1, \"attempting\": 1, \"sense\": 1, \"programmers\": 1, \"define\": 2, \"own\": 3, \"instances\": 2, \"constructed\": 1, \"calling\": 2, \"spamclass\": 1, \"eggsclass\": 1, \"metaclass\": 1, \"itself\": 2, \"reflection\": 1, \"kinds\": 1, \"external\": 2, \"mypy\": 2, \"catch\": 1, \"errors\": 1, \"mypyc\": 1, \"leverages\": 1, \"usual\": 1, \"symbols\": 1, \"modulo\": 1, \"operation\": 1, \"remainder\": 1, \"125\": 1, \"matrix\\u2011multiplication\": 1, \"traditional\": 2, \"math\": 2, \"precedence\": 1, \"rules\": 2, \"unary\": 1, \"represent\": 1, \"positive\": 4, \"respectively\": 3, \"results\": 2, \"significantly\": 1, \"causes\": 1, \"module\": 4, \"see\": 2, \"above\": 1, \"simply\": 1, \"classic\": 1, \"rounding\": 3, \"towards\": 1, \"infinity\": 1, \"though\": 2, \"consistency\": 1, \"equation\": 3, \"valid\": 1, \"maintaining\": 1, \"validity\": 1, \"result\": 2, \"interval\": 2, \"lie\": 1, \"round\": 7, \"float\": 1, \"nearest\": 1, \"tie\": 1, \"breaking\": 1, \"even\": 3, \"produce\": 1, \"away\": 1, \"equality\": 1, \"relations\": 1, \"consistent\": 1, \"mathematics\": 4, \"tests\": 1, \"whether\": 1, \"derived\": 2, \"interpret\": 1, \"differently\": 1, \"evaluate\": 1, \"resulting\": 2, \"compared\": 2, \"arbitrary\": 6, \"precision\": 5, \"decimal\": 3, \"pre\": 1, \"several\": 5, \"modes\": 1, \"fraction\": 1, \"fractions\": 1, \"rational\": 1, \"extensive\": 1, \"party\": 3, \"extends\": 1, \"capabilities\": 2, \"frequently\": 2, \"scientific\": 3, \"scripting\": 7, \"aid\": 1, \"problems\": 1, \"numerical\": 3, \"processing\": 5, \"manipulation\": 1, \"created\": 1, \"you\": 3, \"attributes\": 1, \"required\": 1, \"whatever\": 1, \"want\": 1, \"attribute\": 1, \"defining\": 1, \"inside\": 1, \"definition\": 1, \"hello\": 1, \"world\": 1, \"calculate\": 1, \"factorial\": 1, \"suited\": 1, \"tasks\": 1, \"commonly\": 3, \"cited\": 1, \"greatest\": 1, \"strengths\": 1, \"internet\": 1, \"facing\": 1, \"formats\": 1, \"protocols\": 1, \"mime\": 1, \"http\": 2, \"creating\": 2, \"graphical\": 2, \"connecting\": 1, \"relational\": 2, \"databases\": 1, \"generating\": 1, \"pseudorandom\": 1, \"decimals\": 1, \"manipulating\": 1, \"unit\": 2, \"testing\": 2, \"covered\": 2, \"specifications\\u2014for\": 1, \"server\": 2, \"gateway\": 2, \"interface\": 4, \"wsgi\": 2, \"wsgiref\": 1, \"follows\": 1, \"333\\u2014but\": 1, \"internal\": 1, \"documentation\": 4, \"test\": 2, \"suites\": 1, \"altering\": 1, \"rewriting\": 1, \"variant\": 2, \"implementations\": 8, \"17\": 3, \"march\": 2, \"package\": 6, \"pypi\": 1, \"official\": 3, \"repository\": 2, \"contains\": 3, \"523\": 1, \"000\": 1, \"packages\": 2, \"development\": 13, \"environments\": 2, \"read\\u2013eval\\u2013print\": 1, \"permitting\": 1, \"command\": 2, \"users\": 2, \"enter\": 1, \"sequentially\": 1, \"receive\": 1, \"immediately\": 1, \"integrated\": 2, \"environment\": 2, \"ide\": 4, \"idle\": 2, \"beginner\": 1, \"ipython\": 1, \"add\": 2, \"abilities\": 1, \"auto\": 1, \"completion\": 1, \"session\": 1, \"state\": 2, \"retention\": 1, \"highlighting\": 1, \"desktop\": 1, \"pycharm\": 1, \"intellij\": 1, \"idea\": 1, \"studio\": 1, \"browser\": 2, \"ides\": 1, \"sagemath\": 2, \"developing\": 2, \"science\": 1, \"pythonanywhere\": 1, \"hosting\": 1, \"canopy\": 1, \"commercial\": 2, \"emphasizing\": 1, \"computing\": 3, \"meeting\": 1, \"c89\": 1, \"c11\": 2, \"select\": 1, \"c99\": 1, \"limited\": 1, \"versions\\u2014e\": 1, \"compiles\": 10, \"intermediate\": 1, \"bytecode\": 5, \"executed\": 1, \"virtual\": 1, \"distributed\": 1, \"mixture\": 1, \"installer\": 4, \"deliberately\": 1, \"fails\": 1, \"install\": 1, \"xp\": 2, \"modern\": 2, \"systems\": 3, \"macos\": 2, \"apple\": 3, \"m1\": 1, \"macs\": 1, \"vms\": 1, \"portability\": 1, \"earliest\": 1, \"priorities\": 1, \"os\": 1, \"solaris\": 1, \"threading\": 1, \"alternative\": 1, \"unordered\": 1, \"ecosystem\": 1, \"supporting\": 1, \"fast\": 2, \"compliant\": 1, \"brings\": 1, \"improvement\": 1, \"risc\": 1, \"v\": 1, \"codon\": 2, \"ahead\": 2, \"aot\": 2, \"nearly\": 1, \"differences\": 1, \"64\": 1, \"bit\": 3, \"speedups\": 1, \"10\\u2013100x\": 1, \"llvm\": 2, \"multithreading\": 2, \"imported\": 1, \"stackless\": 2, \"fork\": 2, \"implements\": 1, \"microthreads\": 1, \"massively\": 1, \"concurrent\": 1, \"micropython\": 2, \"circuitpython\": 1, \"variants\": 1, \"optimized\": 1, \"microcontrollers\": 2, \"lego\": 1, \"mindstorms\": 1, \"ev3\": 1, \"pyston\": 1, \"runtime\": 3, \"compilation\": 1, \"cinder\": 1, \"performance\": 6, \"optimizations\": 1, \"inline\": 1, \"caching\": 1, \"eager\": 1, \"evaluation\": 1, \"snek\": 3, \"embedded\": 2, \"avr\": 1, \"atmega\": 1, \"328p\": 1, \"arduino\": 1, \"ones\": 1, \"write\": 1, \"under\": 2, \"imperative\": 1, \"oop\": 1, \"simplifying\": 1, \"32\": 1, \"javascript\": 3, \"smaller\": 2, \"longer\": 1, \"compilers\": 3, \"developed\": 3, \"google\": 3, \"unladen\": 1, \"swallow\": 1, \"2009\": 3, \"speeding\": 1, \"fold\": 1, \"improving\": 1, \"ability\": 1, \"scale\": 1, \"thousands\": 1, \"cores\": 1, \"ordinary\": 1, \"suffer\": 1, \"psyco\": 2, \"discontinued\": 1, \"specializing\": 1, \"integrates\": 1, \"transforms\": 1, \"emitted\": 1, \"specialized\": 3, \"pys60\": 1, \"mobile\": 1, \"phones\": 1, \"nokia\": 2, \"2005\": 2, \"additional\": 1, \"integrating\": 1, \"symbian\": 1, \"n900\": 1, \"gtk\": 2, \"widget\": 1, \"target\": 1, \"device\": 1, \"transpilers\": 1, \"unrestricted\": 1, \"source\": 5, \"brython\": 1, \"transcrypt\": 1, \"pyjs\": 2, \"2012\": 6, \"cython\": 1, \"superset\": 2, \"usable\": 2, \"direct\": 1, \"calls\": 1, \"pyjl\": 1, \"transpiles\": 2, \"human\": 1, \"maintainable\": 1, \"julia\": 3, \"claiming\": 1, \"tool\": 2, \"claim\": 1, \"known\": 1, \"unless\": 1, \"speedup\": 1, \"nuitka\": 1, \"main\": 2, \"android\": 1, \"complete\": 1, \"silicon\": 1, \"ons\": 1, \"hiding\": 1, \"numba\": 1, \"decorator\": 1, \"relevant\": 1, \"translates\": 1, \"pythran\": 1, \"rpython\": 1, \"\\u2192\": 2, \"11l\": 1, \"transpiler\": 1, \"myhdl\": 2, \"hardware\": 1, \"description\": 1, \"hdl\": 1, \"converts\": 1, \"verilog\": 1, \"vhdl\": 1, \"projects\": 3, \"google's\": 1, \"grumpy\": 1, \"2017\": 2, \"go\": 3, \"ironpython\": 2, \"running\": 3, \"although\": 2, \"behaviors\": 1, \"net\": 1, \"jython\": 1, \"pyrex\": 1, \"2010\": 2, \"shed\": 1, \"skin\": 1, \"2013\": 4, \"combinatorial\": 1, \"workload\": 1, \"presented\": 1, \"euroscipy\": 1, \"'13\": 1, \"benchmarked\": 1, \"computer\": 5, \"benchmarks\": 1, \"game\": 2, \"conducted\": 1, \"largely\": 2, \"enhancement\": 2, \"proposal\": 1, \"process\": 1, \"primary\": 2, \"mechanism\": 1, \"proposing\": 1, \"collecting\": 1, \"input\": 1, \"documenting\": 1, \"decisions\": 1, \"outstanding\": 1, \"peps\": 1, \"reviewed\": 1, \"commented\": 1, \"corresponds\": 1, \"mailing\": 1, \"dev\": 1, \"forum\": 1, \"language's\": 1, \"specific\": 2, \"originally\": 3, \"discussed\": 1, \"roundup\": 1, \"tracker\": 1, \"hosted\": 2, \"discussions\": 1, \"migrated\": 1, \"github\": 2, \"took\": 1, \"place\": 1, \"mercurial\": 1, \"moved\": 1, \"cpython's\": 1, \"public\": 1, \"distinguished\": 1, \"incremented\": 4, \"incompatible\": 1, \"manually\": 1, \"happen\": 3, \"infrequently\\u2014version\": 1, \"unlikely\": 1, \"ever\": 1, \"previous\": 1, \"introduce\": 2, \"second\": 1, \"annually\": 1, \"fix\": 1, \"occur\": 1, \"about\": 1, \"sufficient\": 1, \"upstream\": 1, \"vulnerabilities\": 1, \"patched\": 1, \"final\": 2, \"beta\": 1, \"candidates\": 1, \"previews\": 1, \"schedule\": 1, \"delayed\": 1, \"ready\": 1, \"team\": 1, \"monitors\": 1, \"suite\": 1, \"academic\": 1, \"conference\": 1, \"pycon\": 1, \"mentoring\": 1, \"pyladies\": 1, \"wstr\": 1, \"modified\": 1, \"'u'\": 1, \"emit\": 2, \"deprecationwarning\": 2, \"'w'\": 1, \"ctypes\": 1, \"cgihttprequesthandler\": 1, \"potential\": 1, \"namedtuple\": 1, \"arguments\": 1, \"denote\": 1, \"fields\": 1, \"disallowed\": 1, \"generate\": 1, \"pydoc\": 1, \"sphinx\": 1, \"pdoc\": 1, \"forks\": 1, \"doxygen\": 1, \"graphviz\": 1, \"among\": 2, \"others\": 1, \"naming\": 1, \"whom\": 1, \"creator\": 2, \"enjoyed\": 1, \"references\": 3, \"appear\": 1, \"metasyntactic\": 1, \"literature\": 1, \"routines\": 1, \"pythonistas\": 1, \"prefix\": 2, \"py\": 1, \"pygame\": 1, \"directmedia\": 1, \"layer\": 1, \"games\": 2, \"pyqt\": 1, \"pygtk\": 1, \"bind\": 1, \"qt\": 1, \"popularity\": 1, \"2003\": 1, \"ranked\": 1, \"ten\": 1, \"tiobe\": 1, \"selected\": 1, \"year\": 2, \"highest\": 1, \"rise\": 1, \"ratings\": 1, \"2007\": 1, \"done\": 1, \"organizations\": 2, \"wikipedia\": 1, \"yahoo\": 1, \"cern\": 1, \"nasa\": 1, \"facebook\": 1, \"amazon\": 1, \"instagram\": 1, \"spotify\": 1, \"entities\": 1, \"industrial\": 1, \"light\": 1, \"magic\": 1, \"ita\": 1, \"social\": 1, \"news\": 1, \"networking\": 1, \"site\": 1, \"reddit\": 1, \"mostly\": 1, \"partially\": 1, \"discord\": 1, \"baidu\": 1, \"serve\": 1, \"mod\": 1, \"apache\": 1, \"webserver\": 1, \"evolved\": 1, \"facilitate\": 1, \"frameworks\": 1, \"django\": 1, \"pylons\": 1, \"pyramid\": 1, \"turbogears\": 1, \"web2py\": 1, \"tornado\": 1, \"flask\": 1, \"bottle\": 1, \"zope\": 1, \"maintenance\": 1, \"develop\": 1, \"client\": 1, \"ajax\": 1, \"sqlalchemy\": 1, \"mapper\": 1, \"database\": 1, \"twisted\": 1, \"framework\": 1, \"communications\": 1, \"computers\": 1, \"dropbox\": 1, \"scipy\": 1, \"matplotlib\": 1, \"effective\": 1, \"biopython\": 1, \"astropy\": 1, \"providing\": 2, \"domain\": 1, \"algebra\": 2, \"notebook\": 1, \"covers\": 1, \"aspects\": 1, \"combinatorics\": 1, \"theory\": 1, \"calculus\": 1, \"opencv\": 1, \"bindings\": 1, \"rich\": 2, \"image\": 2, \"artificial\": 3, \"intelligence\": 3, \"help\": 1, \"tensorflow\": 1, \"keras\": 1, \"pytorch\": 1, \"scikit\": 1, \"learn\": 1, \"problog\": 1, \"modular\": 1, \"architecture\": 1, \"text\": 4, \"prolog\": 2, \"proved\": 1, \"ai\": 3, \"knowledge\": 1, \"representation\": 1, \"reasoning\": 2, \"janus\": 1, \"exploits\": 1, \"similarities\": 1, \"recursive\": 1, \"structures\": 2, \"typical\": 1, \"query\": 1, \"answering\": 1, \"geospatial\": 1, \"natlog\": 1, \"definite\": 1, \"clause\": 1, \"grammars\": 1, \"dcgs\": 1, \"prompt\": 1, \"gpt3\": 1, \"dall\": 1, \"diffusion\": 1, \"gui\": 1, \"tkinter\": 1, \"successfully\": 1, \"products\": 1, \"finite\": 1, \"abaqus\": 1, \"3d\": 2, \"parametric\": 1, \"modelers\": 1, \"freecad\": 1, \"animation\": 1, \"3ds\": 1, \"max\": 1, \"blender\": 1, \"cinema\": 1, \"4d\": 1, \"lightwave\": 1, \"houdini\": 1, \"maya\": 1, \"modo\": 1, \"motionbuilder\": 1, \"softimage\": 1, \"effects\": 1, \"compositor\": 1, \"nuke\": 1, \"2d\": 1, \"imaging\": 1, \"gimp\": 1, \"inkscape\": 1, \"scribus\": 1, \"paint\": 1, \"shop\": 1, \"pro\": 1, \"musical\": 1, \"notation\": 1, \"scorewriter\": 1, \"capella\": 1, \"gnu\": 1, \"debugger\": 1, \"pretty\": 1, \"printer\": 1, \"containers\": 1, \"esri\": 1, \"promotes\": 1, \"best\": 1, \"writing\": 1, \"scripts\": 1, \"arcgis\": 1, \"video\": 1, \"adopted\": 2, \"app\": 1, \"engine\": 2, \"component\": 1, \"ships\": 1, \"linux\": 5, \"distributions\": 2, \"amigaos\": 1, \"freebsd\": 1, \"netbsd\": 1, \"openbsd\": 1, \"terminal\": 1, \"installers\": 1, \"ubuntu\": 1, \"ubiquity\": 1, \"red\": 1, \"hat\": 1, \"fedora\": 1, \"anaconda\": 1, \"gentoo\": 1, \"portage\": 1, \"extensively\": 1, \"information\": 1, \"industry\": 1, \"exploit\": 1, \"laptop\": 1, \"per\": 1, \"child\": 1, \"xo\": 1, \"labs\": 1, \"raspberry\": 1, \"pi\": 1, \"board\": 1, \"libreoffice\": 1, \"intends\": 1, \"replace\": 1, \"provider\": 1, \"february\": 2, \"boo\": 1, \"model\": 1, \"cobra\": 1, \"acknowledgements\": 1, \"document\": 2, \"coffeescript\": 1, \"ecmascript\\u2013javascript\": 1, \"gdscript\": 1, \"godot\": 1, \"shares\": 1, \"arrays\": 1, \"groovy\": 1, \"motivated\": 1, \"desire\": 1, \"bring\": 1, \"mojo\": 1, \"strict\": 1, \"still\": 1, \"missing\": 1, \"nim\": 1, \"ruby's\": 1, \"yukihiro\": 1, \"matsumoto\": 1, \"wanted\": 1, \"powerful\": 1, \"that's\": 1, \"why\": 1, \"decided\": 1, \"my\": 1, \"swift\": 2, \"kotlin\": 1, \"blends\": 1, \"minimizing\": 1, \"boilerplate\": 1, \"enhanced\": 1, \"efficiency\": 1, \"practices\": 1, \"emulated\": 1, \"requiring\": 1, \"describing\": 1, \"rationale\": 1, \"surrounding\": 1, \"tcl\": 1, \"erlang\": 1, \"pip\": 1, \"sources\": 1, \"wiki\": 1, \"19\": 1, \"archived\": 2, \"original\": 2, \"november\": 1, \"retrieved\": 3, \"paine\": 1, \"jocelyn\": 1, \"ed\": 5, \"august\": 1, \"expert\": 1, \"newsletter\": 1, \"26\": 1, \"russell\": 1, \"stuart\": 1, \"j\": 1, \"norvig\": 1, \"peter\": 1, \"3rd\": 2, \"upper\": 1, \"saddle\": 1, \"river\": 1, \"nj\": 1, \"prentice\": 1, \"hall\": 1, \"isbn\": 5, \"978\": 5, \"604259\": 1, \"reading\": 1, \"downey\": 1, \"allen\": 1, \"think\": 2, \"scientist\": 1, \"o'reilly\": 3, \"media\": 3, \"1098155438\": 1, \"lutz\": 1, \"mark\": 2, \"5th\": 1, \"596\": 1, \"15806\": 1, \"summerfield\": 1, \"2nd\": 1, \"addison\": 1, \"wesley\": 1, \"professional\": 1, \"321\": 1, \"68056\": 1, \"ramalho\": 1, \"luciano\": 1, \"fluent\": 1, \"4920\": 1, \"5632\": 1, \"links\": 1, \"website\": 1, \"tutorial\": 1}", "word_docs": "{\"programming\": 25, \"high\": 5, \"is\": 101, \"a\": 125, \"general\": 4, \"python\": 200, \"language\": 40, \"level\": 3, \"purpose\": 1, \"philosophy\": 7, \"of\": 113, \"readability\": 3, \"indentation\": 7, \"significant\": 3, \"the\": 162, \"design\": 9, \"code\": 34, \"its\": 24, \"use\": 25, \"emphasizes\": 1, \"with\": 58, \"dynamically\": 3, \"collected\": 1, \"garbage\": 4, \"type\": 13, \"checked\": 2, \"and\": 168, \"functional\": 4, \"procedural\": 1, \"particularly\": 3, \"object\": 15, \"it\": 51, \"supports\": 6, \"including\": 19, \"multiple\": 5, \"oriented\": 8, \"structured\": 2, \"paradigms\": 2, \"due\": 4, \"comprehensive\": 1, \"described\": 1, \"included\": 2, \"often\": 10, \"library\": 12, \"as\": 70, \"batteries\": 1, \"standard\": 17, \"to\": 142, \"0\": 22, \"1991\": 1, \"guido\": 5, \"1980s\": 2, \"van\": 8, \"late\": 3, \"began\": 3, \"on\": 23, \"abc\": 3, \"released\": 11, \"rossum\": 7, \"successor\": 2, \"in\": 115, \"working\": 2, \"first\": 7, \"was\": 23, \"2000\": 2, \"versions\": 11, \"2008\": 3, \"completely\": 1, \"backward\": 2, \"revision\": 1, \"earlier\": 1, \"compatible\": 4, \"major\": 6, \"not\": 23, \"release\": 10, \"last\": 2, \"2\": 29, \"18\": 2, \"2020\": 3, \"popular\": 3, \"most\": 13, \"community\": 6, \"one\": 10, \"learning\": 3, \"consistently\": 2, \"has\": 35, \"gained\": 1, \"machine\": 9, \"languages\": 24, \"widespread\": 1, \"ranks\": 1, \"exception\": 3, \"handling\": 3, \"operating\": 4, \"informatica\": 1, \"history\": 2, \"capable\": 1, \"system\": 7, \"conceived\": 1, \"amoeba\": 1, \"wiskunde\": 1, \"at\": 15, \"centrum\": 1, \"which\": 19, \"netherlands\": 1, \"by\": 36, \"cwi\": 1, \"interfacing\": 1, \"setl\": 1, \"inspired\": 4, \"december\": 4, \"implementation\": 8, \"1989\": 1, \"life\": 4, \"maker\": 1, \"bestowed\": 1, \"come\": 3, \"bdfl\": 1, \"developer\": 2, \"decision\": 1, \"from\": 29, \"shouldered\": 1, \"benevolent\": 2, \"reflect\": 1, \"commitment\": 1, \"long\": 2, \"out\": 3, \"responsibilities\": 1, \"upon\": 1, \"term\": 1, \"responsibility\": 1, \"python's\": 19, \"announced\": 1, \"project's\": 1, \"when\": 4, \"dictator\": 2, \"self\": 3, \"for\": 94, \"vacation\": 1, \"emeritus\": 1, \"2018\": 2, \"him\": 1, \"project\": 4, \"retirement\": 1, \"title\": 1, \"lead\": 2, \"his\": 2, \"since\": 12, \"he\": 1, \"12\": 8, \"chief\": 1, \"july\": 4, \"permanent\": 1, \"titled\": 1, \"sole\": 1, \"until\": 3, \"five\": 2, \"council\": 2, \"developers\": 5, \"january\": 2, \"member\": 1, \"2019\": 1, \"active\": 2, \"core\": 5, \"steering\": 2, \"elected\": 1, \"name\": 7, \"flying\": 1, \"comedy\": 3, \"series\": 2, \"said\": 2, \"monty\": 5, \"circus\": 1, \"british\": 3, \"such\": 20, \"reference\": 10, \"list\": 8, \"16\": 1, \"many\": 22, \"october\": 2, \"unicode\": 1, \"new\": 13, \"comprehensions\": 4, \"collection\": 2, \"detecting\": 2, \"features\": 14, \"counting\": 2, \"cycle\": 2, \"support\": 19, \"body\": 2, \"set\": 3, \"3\": 64, \"existing\": 2, \"ported\": 2, \"large\": 6, \"that\": 45, \"postponed\": 1, \"initially\": 2, \"then\": 7, \"easily\": 3, \"7's\": 1, \"be\": 55, \"concern\": 1, \"end\": 4, \"forward\": 1, \"2015\": 1, \"could\": 1, \"will\": 13, \"patches\": 2, \"security\": 10, \"no\": 8, \"further\": 4, \"improvements\": 1, \"other\": 20, \"or\": 37, \"while\": 8, \"officially\": 1, \"different\": 4, \"continues\": 2, \"older\": 3, \"i\": 8, \"7\": 12, \"unsupported\": 3, \"are\": 47, \"unofficial\": 2, \"pypy\": 6, \"plus\": 3, \"meaning\": 3, \"updates\": 2, \"backported\": 1, \"10\": 7, \"least\": 5, \"some\": 20, \"semantics\": 10, \"syntax\": 22, \"changed\": 7, \"now\": 3, \"every\": 2, \"5\": 10, \"dropped\": 3, \"modules\": 12, \"few\": 4, \"have\": 12, \"releases\": 9, \"later\": 3, \"minor\": 1, \"added\": 6, \"outdated\": 3, \"way\": 5, \"2024\": 4, \"13\": 7, \"more\": 12, \"latest\": 4, \"stable\": 2, \"months\": 2, \"opposed\": 1, \"just\": 7, \"only\": 8, \"fixes\": 2, \"bug\": 4, \"version\": 13, \"phase\": 1, \"supported\": 9, \"albeit\": 1, \"9\": 4, \"support'\": 1, \"'security\": 1, \"oldest\": 1, \"8\": 9, \"reaching\": 1, \"starting\": 3, \"half\": 2, \"before\": 7, \"years\": 3, \"total\": 1, \"same\": 9, \"full\": 3, \"up\": 6, \"followed\": 1, \"twice\": 1, \"2023\": 1, \"september\": 1, \"again\": 2, \"were\": 7, \"2022\": 4, \"expedited\": 1, \"2021\": 2, \"fixed\": 3, \"down\": 1, \"6\": 4, \"insecure\": 1, \"all\": 12, \"20\": 2, \"cache\": 1, \"remote\": 1, \"possible\": 7, \"issues\": 5, \"poisoning\": 1, \"execution\": 5, \"web\": 7, \"leading\": 1, \"because\": 4, \"match\": 2, \"statements\": 8, \"union\": 1, \"matching\": 2, \"pattern\": 2, \"structural\": 1, \"operator\": 16, \"case\": 3, \"keywords\": 3, \"functionality\": 7, \"11\": 7, \"expanded\": 1, \"keyword\": 3, \"notable\": 2, \"changes\": 3, \"include\": 10, \"reporting\": 1, \"program\": 7, \"increased\": 1, \"improved\": 5, \"speed\": 10, \"error\": 3, \"faster\": 4, \"between\": 6, \"claims\": 4, \"60\": 2, \"than\": 15, \"top\": 2, \"another\": 2, \"adds\": 3, \"messages\": 1, \"also\": 27, \"14\": 3, \"addition\": 4, \"incremental\": 1, \"interactive\": 1, \"producing\": 2, \"repl\": 2, \"multi\": 3, \"lot\": 1, \"collector\": 2, \"editing\": 1, \"objects\": 4, \"types\": 5, \"color\": 1, \"pauses\": 1, \"introduces\": 2, \"shorter\": 1, \"line\": 3, \"featuring\": 1, \"interpreter\": 9, \"programs\": 10, \"an\": 21, \"run\": 4, \"time\": 11, \"lock\": 3, \"enabled\": 2, \"feature\": 4, \"experimental\": 4, \"increase\": 2, \"allowing\": 5, \"global\": 2, \"specifically\": 1, \"jit\": 3, \"can\": 22, \"threads\": 1, \"python3\": 2, \"gil\": 1, \"free\": 2, \"build\": 2, \"concurrently\": 1, \"needs\": 3, \"mode\": 2, \"threaded\": 1, \"disables\": 1, \"latter\": 2, \"compiler\": 9, \"13t\": 1, \"behavior\": 4, \"change\": 3, \"frame\": 1, \"c\": 24, \"bugs\": 3, \"api\": 5, \"well\": 5, \"functions\": 11, \"defined\": 4, \"methods\": 6, \"removals\": 1, \"locals\": 3, \"deprecated\": 6, \"fixing\": 1, \"removed\": 5, \"classes\": 8, \"old\": 2, \"oddities\": 1, \"f\": 2, \"cases\": 4, \"slow\": 1, \"buggy\": 1, \"inconsistent\": 1, \"corner\": 1, \"those\": 1, \"around\": 1, \"may\": 13, \"need\": 3, \"works\": 2, \"correctly\": 1, \"uses\": 23, \"debugging\": 2, \"templating\": 1, \"continue\": 3, \"print\": 2, \"simple\": 5, \"work\": 4, \"sigstore\": 2, \"pgp\": 2, \"digital\": 1, \"artifacts\": 1, \"signatures\": 1, \"cpython\": 13, \"verification\": 1, \"criticized\": 1, \"exclusively\": 1, \"practitioners\": 1, \"dropping\": 1, \"moving\": 2, \"been\": 8, \"alpha\": 3, \"annotations\": 5, \"regarding\": 1, \"converting\": 1, \"future\": 3, \"import\": 3, \"into\": 8, \"did\": 1, \"strings\": 6, \"711\": 1, \"pybi\": 1, \"proposes\": 1, \"pep\": 6, \"binaries\": 1, \"distributing\": 1, \"format\": 7, \"15\": 1, \"but\": 18, \"exists\": 1, \"utf\": 3, \"opted\": 1, \"currently\": 1, \"default\": 2, \"current\": 7, \"make\": 2, \"windows\": 5, \"e\": 18, \"already\": 3, \"elsewhere\": 1, \"things\": 1, \"used\": 34, \"open\": 2, \"enabling\": 2, \"cross\": 5, \"makes\": 2, \"fully\": 2, \"platform\": 3, \"it's\": 3, \"files\": 1, \"everything\": 1, \"platforms\": 4, \"paradigm\": 1, \"aspect\": 1, \"their\": 7, \"metaprogramming\": 2, \"metaobjects\": 1, \"via\": 5, \"contract\": 1, \"extensions\": 3, \"logic\": 2, \"referred\": 3, \"'glue\": 1, \"written\": 13, \"components\": 1, \"language'\": 1, \"integrate\": 1, \"seamlessly\": 1, \"memory\": 1, \"dynamic\": 6, \"combination\": 3, \"management\": 2, \"typing\": 6, \"names\": 4, \"method\": 7, \"resolution\": 1, \"binds\": 2, \"during\": 3, \"binding\": 2, \"variable\": 9, \"offers\": 1, \"lisp\": 2, \"tradition\": 1, \"filter\": 1, \"sets\": 1, \"mapandreduce\": 1, \"generator\": 5, \"expressions\": 13, \"dictionaries\": 4, \"ml\": 1, \"haskell\": 1, \"functools\": 1, \"borrowed\": 2, \"tools\": 5, \"itertools\": 1, \"implement\": 2, \"two\": 6, \"aphorisms\": 1, \"summarized\": 1, \"beautiful\": 1, \"ugly\": 1, \"better\": 5, \"zen\": 2, \"includes\": 4, \"implicit\": 2, \"explicit\": 2, \"complex\": 4, \"complicated\": 1, \"counts\": 1, \"principles\": 1, \"received\": 1, \"unnecessary\": 1, \"however\": 7, \"regularly\": 1, \"violate\": 1, \"these\": 9, \"adding\": 7, \"criticism\": 1, \"bloat\": 1, \"guideline\": 1, \"rather\": 6, \"rule\": 2, \"criticisms\": 1, \"responses\": 1, \"so\": 3, \"expression\": 9, \"controversial\": 1, \"assignment\": 5, \"resigned\": 1, \"vitriol\": 1, \"over\": 6, \"following\": 1, \"had\": 2, \"designed\": 3, \"highly\": 1, \"nevertheless\": 1, \"extensible\": 2, \"building\": 1, \"modularity\": 1, \"made\": 2, \"programmable\": 2, \"means\": 4, \"applications\": 9, \"interfaces\": 2, \"compact\": 1, \"this\": 12, \"vision\": 2, \"stemmed\": 1, \"espoused\": 1, \"approach\": 2, \"opposite\": 1, \"small\": 1, \"frustrations\": 1, \"rossum's\": 1, \"methodology\": 1, \"coding\": 2, \"less\": 2, \"giving\": 1, \"choice\": 2, \"simpler\": 1, \"cluttered\": 1, \"grammar\": 1, \"strive\": 2, \"contrast\": 4, \"embraces\": 1, \"preferably\": 1, \"do\": 2, \"one\\u2014obvious\": 1, \"perl's\": 1, \"motto\": 1, \"should\": 4, \"one\\u2014and\": 1, \"there\": 9, \"practice\": 2, \"achieve\": 1, \"task\": 1, \"provides\": 6, \"ways\": 2, \"example\": 13, \"string\": 9, \"literal\": 3, \"three\": 4, \"certainty\": 1, \"programmer\": 1, \"wrote\": 1, \"software\": 4, \"describe\": 1, \"foundation\": 2, \"martelli\": 1, \"alex\": 1, \"compliment\": 1, \"author\": 1, \"book\": 1, \"culture\": 2, \"something\": 2, \"fellow\": 1, \"considered\": 1, \"'clever'\": 1, \"avoid\": 1, \"premature\": 1, \"clarity\": 1, \"cost\": 1, \"marginal\": 1, \"offer\": 1, \"parts\": 3, \"usually\": 2, \"optimization\": 3, \"would\": 2, \"reject\": 1, \"non\": 3, \"increases\": 1, \"critical\": 2, \"extension\": 2, \"like\": 17, \"using\": 11, \"subset\": 6, \"compiled\": 3, \"slightly\": 2, \"either\": 2, \"might\": 1, \"provide\": 1, \"very\": 3, \"expected\": 4, \"compile\": 6, \"doesn't\": 1, \"restricted\": 2, \"possibly\": 1, \"fun\": 1, \"aim\": 2, \"occasionally\": 1, \"reflected\": 1, \"python\\u2014and\": 1, \"approaches\": 1, \"tutorials\": 1, \"spam\": 6, \"tribute\": 1, \"examples\": 3, \"name\\u2014a\": 1, \"eggs\": 6, \"instead\": 3, \"group\": 2, \"playful\": 1, \"bar\": 2, \"foo\": 2, \"materials\": 1, \"terms\": 2, \"sketch\": 1, \"related\": 3, \"meanings\": 1, \"wide\": 2, \"pythonic\": 2, \"neologism\": 1, \"common\": 6, \"range\": 2, \"style\": 4, \"natural\": 3, \"fluency\": 1, \"emphasis\": 1, \"minimalist\": 1, \"idioms\": 1, \"show\": 3, \"conform\": 1, \"rough\": 2, \"understand\": 1, \"called\": 7, \"reads\": 1, \"unpythonic\": 1, \"difficult\": 1, \"transcription\": 1, \"meant\": 1, \"readable\": 2, \"formatting\": 1, \"english\": 1, \"where\": 8, \"punctuation\": 1, \"visually\": 1, \"uncluttered\": 1, \"brackets\": 2, \"curly\": 2, \"allowed\": 1, \"after\": 4, \"delimit\": 2, \"semicolons\": 1, \"rarely\": 1, \"blocks\": 3, \"unlike\": 4, \"does\": 5, \"special\": 2, \"pascal\": 1, \"syntactic\": 2, \"fewer\": 1, \"exceptions\": 2, \"whitespace\": 1, \"comes\": 2, \"decrease\": 1, \"block\": 3, \"certain\": 3, \"signifies\": 1, \"semantic\": 3, \"program's\": 1, \"represents\": 1, \"accurately\": 1, \"structure\": 1, \"thus\": 4, \"visual\": 4, \"off\": 1, \"side\": 4, \"sometimes\": 2, \"termed\": 1, \"size\": 1, \"four\": 2, \"indent\": 1, \"recommended\": 1, \"spaces\": 1, \"true\": 3, \"statement\": 7, \"iterates\": 1, \"equals\": 1, \"attached\": 2, \"local\": 2, \"conditionally\": 1, \"sign\": 3, \"along\": 1, \"else\": 2, \"single\": 5, \"executes\": 2, \"each\": 8, \"handled\": 2, \"flow\": 2, \"except\": 2, \"capturing\": 1, \"raised\": 1, \"if\": 8, \"clauses\": 1, \"control\": 2, \"contraction\": 1, \"iterable\": 2, \"condition\": 1, \"allows\": 5, \"element\": 3, \"elif\": 1, \"try\": 2, \"caught\": 2, \"function\": 8, \"iteration\": 1, \"variables\": 4, \"initialization\": 1, \"resource\": 1, \"acquiring\": 1, \"return\": 1, \"finally\": 1, \"closing\": 1, \"serving\": 1, \"construct\": 1, \"manager\": 2, \"regardless\": 1, \"context\": 1, \"file\": 1, \"value\": 4, \"raii\": 1, \"variable\\u2014deleting\": 1, \"raise\": 1, \"apply\": 1, \"ensures\": 1, \"coroutines\": 2, \"namespace\": 1, \"analog\": 1, \"clean\": 1, \"specified\": 3, \"loop\": 2, \"re\": 1, \"defines\": 1, \"assert\": 1, \"encloses\": 1, \"releasing\": 1, \"skips\": 1, \"switch\": 1, \"returns\": 4, \"opening\": 1, \"def\": 2, \"pass\": 2, \"break\": 2, \"conditions\": 1, \"exits\": 1, \"always\": 4, \"needed\": 1, \"removes\": 1, \"attaches\": 1, \"compares\": 2, \"empty\": 1, \"whose\": 1, \"acquisition\": 1, \"create\": 2, \"redefined\": 1, \"groups\": 1, \"how\": 3, \"replacing\": 1, \"next\": 1, \"check\": 1, \"del\": 1, \"yield\": 1, \"rest\": 1, \"within\": 1, \"against\": 1, \"syntactically\": 1, \"class\": 9, \"measure\": 1, \"idiom\": 1, \"nop\": 1, \"separate\": 1, \"allocated\": 1, \"any\": 1, \"rebound\": 1, \"subsequently\": 1, \"refers\": 1, \"data\": 9, \"holder\": 1, \"generic\": 1, \"without\": 1, \"typing\\u2014in\": 1, \"typed\": 4, \"statically\": 2, \"contain\": 3, \"tail\": 1, \"continuations\": 1, \"call\": 2, \"according\": 2, \"never\": 1, \"generators\": 5, \"coroutine\": 1, \"extending\": 1, \"provided\": 3, \"iterators\": 2, \"passed\": 2, \"lazy\": 1, \"unidirectionally\": 1, \"back\": 2, \"levels\": 1, \"stack\": 2, \"through\": 3, \"division\": 11, \"multiplication\": 2, \"differs\": 1, \"similar\": 7, \"operators\": 4, \"subtraction\": 1, \"mathematical\": 1, \"floating\": 4, \"divisions\": 1, \"integer\": 5, \"point\": 4, \"floor\": 4, \"exponentiation\": 2, \"concatenation\": 1, \"times\": 2, \"duplicating\": 2, \"number\": 11, \"numpy\": 4, \"infix\": 2, \"libraries\": 9, \"matrix\": 1, \"intended\": 1, \"walrus\": 1, \"introduced\": 2, \"part\": 10, \"values\": 3, \"larger\": 3, \"assigns\": 2, \"comparison\": 4, \"comparisons\": 1, \"identities\": 1, \"chained\\u2014for\": 1, \"compare\": 2, \"b\": 6, \"boolean\": 2, \"named\": 2, \"comprehension\": 1, \"anonymous\": 1, \"implemented\": 4, \"lambda\": 2, \"order\": 2, \"x\": 2, \"operands\": 1, \"y\": 1, \"conditional\": 3, \"distinction\": 2, \"tuples\": 4, \"lists\": 4, \"dictionary\": 1, \"1\": 12, \"cannot\": 4, \"immutable\": 3, \"must\": 1, \"keys\": 2, \"mutable\": 1, \"elements\": 4, \"tuple's\": 1, \"directly\": 1, \"tuple\": 3, \"produces\": 3, \"containing\": 1, \"modify\": 2, \"contents\": 2, \"both\": 6, \"concatenate\": 1, \"yields\": 1, \"t\\u2014thereby\": 1, \"t\": 1, \"evaluates\": 2, \"executing\": 1, \"effectively\": 1, \"given\": 2, \"4\": 9, \"assigned\": 2, \"equal\": 3, \"nature\": 2, \"conforming\": 1, \"modifying\": 1, \"contexts\": 1, \"optional\": 2, \"parentheses\": 1, \"unambiguous\": 1, \"unpacking\": 1, \"sequence\": 1, \"evaluating\": 1, \"property\": 1, \"anything\": 1, \"etc\": 2, \"writable\": 2, \"hand\": 2, \"associated\": 1, \"literals\\u2014and\": 1, \"manner\": 2, \"put\": 1, \"left\": 2, \"identical\": 2, \"whole\": 1, \"forming\": 1, \"expects\": 1, \"corresponding\": 1, \"iterated\": 1, \"right\": 1, \"produced\": 1, \"them\": 4, \"printf\": 1, \"c\\u2014e\": 1, \"analogously\": 1, \"d\": 1, \"blah\": 3, \"s\": 1, \"str\": 1, \"supplemented\": 1, \"'\": 1, \"f'spam\": 1, \"concatenated\": 1, \"floats\": 1, \"integers\": 4, \"spameggs\": 1, \"they\": 4, \"numbers\": 5, \"22\": 1, \"perl\": 3, \"double\": 3, \"quotes\": 2, \"literals\": 2, \"influenced\": 3, \"various\": 3, \"delimited\": 1, \"shells\": 3, \"unix\": 2, \"character\": 1, \"backslash\": 1, \"escape\": 2, \"interpolation\": 1, \"available\": 5, \"became\": 1, \"formatted\": 1, \"lines\": 1, \"documents\": 1, \"ending\": 2, \"triple\": 1, \"here\": 2, \"ruby\": 3, \"span\": 1, \"beginning\": 2, \"quoted\": 1, \"varieties\": 1, \"prefixing\": 1, \"r\": 1, \"denoted\": 2, \"raw\": 2, \"hence\": 1, \"interpreted\": 1, \"paths\": 1, \"regular\": 2, \"sequences\": 1, \"backslashes\": 1, \"useful\": 2, \"quoting\": 1, \"slicing\": 2, \"step\": 2, \"array\": 2, \"key\": 1, \"stop\": 2, \"index\": 5, \"start\": 2, \"negative\": 6, \"indexes\": 2, \"based\": 7, \"zero\": 2, \"relative\": 1, \"take\": 1, \"slices\": 1, \"stride\": 1, \"third\": 5, \"reversed\": 1, \"skipped\": 1, \"parameter\": 2, \"slice\": 3, \"copy\": 2, \"entire\": 1, \"omitted\\u2014for\": 1, \"shallow\": 1, \"enforced\": 2, \"rigidly\": 1, \"scheme\": 1, \"leads\": 1, \"vs\": 3, \"loops\": 1, \"eval\": 1, \"being\": 3, \"exec\": 1, \"former\": 1, \"expression\\u2014so\": 1, \"built\": 2, \"form\": 1, \"particular\": 2, \"instance\": 5, \"object's\": 1, \"sugar\": 2, \"argument\": 2, \"normal\": 1, \"access\": 1, \"objective\": 1, \"java\": 7, \"underscores\": 1, \"conversion\": 1, \"allow\": 2, \"native\": 4, \"user\": 4, \"length\": 1, \"operations\": 5, \"dunder\": 1, \"arithmetic\": 4, \"untyped\": 1, \"duck\": 1, \"constraints\": 1, \"suitable\": 1, \"fail\": 1, \"signifying\": 1, \"attempting\": 1, \"forbidding\": 1, \"despite\": 2, \"silently\": 1, \"strongly\": 1, \"sense\": 1, \"programmers\": 1, \"define\": 2, \"own\": 3, \"calling\": 2, \"itself\": 1, \"constructed\": 1, \"reflection\": 1, \"spamclass\": 1, \"instances\": 1, \"metaclass\": 1, \"eggsclass\": 1, \"kinds\": 1, \"catch\": 1, \"external\": 2, \"mypy\": 2, \"errors\": 1, \"mypyc\": 1, \"leverages\": 1, \"symbols\": 1, \"modulo\": 1, \"usual\": 1, \"operation\": 1, \"remainder\": 1, \"125\": 1, \"matrix\\u2011multiplication\": 1, \"unary\": 1, \"precedence\": 1, \"positive\": 4, \"rules\": 2, \"traditional\": 2, \"represent\": 1, \"math\": 2, \"respectively\": 3, \"results\": 2, \"significantly\": 1, \"causes\": 1, \"module\": 4, \"above\": 1, \"see\": 2, \"simply\": 1, \"classic\": 1, \"towards\": 1, \"rounding\": 3, \"infinity\": 1, \"consistency\": 1, \"though\": 2, \"equation\": 3, \"valid\": 1, \"lie\": 1, \"validity\": 1, \"result\": 2, \"maintaining\": 1, \"interval\": 1, \"nearest\": 1, \"round\": 5, \"float\": 1, \"tie\": 1, \"breaking\": 1, \"even\": 3, \"produce\": 1, \"away\": 1, \"mathematics\": 3, \"relations\": 1, \"consistent\": 1, \"equality\": 1, \"tests\": 1, \"whether\": 1, \"derived\": 2, \"interpret\": 1, \"compared\": 2, \"differently\": 1, \"evaluate\": 1, \"resulting\": 2, \"precision\": 5, \"arbitrary\": 6, \"modes\": 1, \"decimal\": 1, \"pre\": 1, \"several\": 5, \"fraction\": 1, \"rational\": 1, \"fractions\": 1, \"capabilities\": 2, \"numerical\": 3, \"problems\": 1, \"scientific\": 3, \"party\": 3, \"frequently\": 2, \"extends\": 1, \"manipulation\": 1, \"processing\": 4, \"extensive\": 1, \"aid\": 1, \"scripting\": 7, \"created\": 1, \"you\": 2, \"required\": 1, \"attributes\": 1, \"whatever\": 1, \"attribute\": 1, \"want\": 1, \"inside\": 1, \"defining\": 1, \"definition\": 1, \"tasks\": 1, \"hello\": 1, \"cited\": 1, \"suited\": 1, \"world\": 1, \"factorial\": 1, \"strengths\": 1, \"commonly\": 3, \"calculate\": 1, \"greatest\": 1, \"formats\": 1, \"protocols\": 1, \"facing\": 1, \"mime\": 1, \"http\": 2, \"internet\": 1, \"manipulating\": 1, \"databases\": 1, \"decimals\": 1, \"pseudorandom\": 1, \"creating\": 2, \"graphical\": 2, \"unit\": 2, \"relational\": 2, \"generating\": 1, \"connecting\": 1, \"testing\": 2, \"wsgi\": 2, 